<script></script>

<template>
  <section class="restaurants">
    <div class="restaurants-title-box flex-content-start">
      <h2 class="restaurants-title">Тануки</h2>
      <div class="restaurant-rating"><img src="../assets/icons/star-icon.svg" alt="star icon">4.5</div>
      <div class="restaurant-price">От 900 &#8381; &bull; Пицца </div>
    </div>
    <div class="cards-box">
      <div class="card food-card">
        <div class="card-img food-card-img">
          <img src="../assets/images/food-1.jpg" alt="dish image">
        </div>
        <div class="food-card-info-wrapper">
          <h3 class="card-name food-card-title">Ролл угорь стандарт</h3>
          <p class="food-card-description">Рис, угорь, соус унаги,<br> кунжут, водоросли нори.</p>
          <div class="card-info-box">
            <button type="button" class="btn primary-btn">
              В корзину
              <svg width="15" height="13" viewBox="0 0 15 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path
                  d="M14.4202 8.96719H5.11549L5.58268 8.01562L13.3452 8.00156C13.6077 8.00156 13.8327 7.81406 13.8796 7.55469L14.9546 1.5375C14.9827 1.37969 14.9405 1.21719 14.8374 1.09375C14.7864 1.033 14.7228 0.984065 14.6511 0.950339C14.5793 0.916613 14.501 0.898903 14.4217 0.898438L4.54674 0.865625L4.46237 0.46875C4.40924 0.215625 4.18112 0.03125 3.92174 0.03125H1.50768C1.36139 0.03125 1.2211 0.0893608 1.11766 0.192799C1.01423 0.296237 0.956116 0.436529 0.956116 0.582813C0.956116 0.729096 1.01423 0.869388 1.11766 0.972826C1.2211 1.07626 1.36139 1.13438 1.50768 1.13438H3.47487L3.84362 2.8875L4.75143 7.28281L3.58268 9.19063C3.52198 9.27254 3.48543 9.36981 3.47714 9.47143C3.46886 9.57305 3.48918 9.67496 3.5358 9.76562C3.62955 9.95156 3.81862 10.0688 4.02799 10.0688H5.00924C4.80005 10.3466 4.68706 10.685 4.68737 11.0328C4.68737 11.9172 5.40612 12.6359 6.29049 12.6359C7.17487 12.6359 7.89362 11.9172 7.89362 11.0328C7.89362 10.6844 7.77799 10.3453 7.57174 10.0688H10.0889C9.87974 10.3466 9.76675 10.685 9.76705 11.0328C9.76705 11.9172 10.4858 12.6359 11.3702 12.6359C12.2546 12.6359 12.9733 11.9172 12.9733 11.0328C12.9733 10.6844 12.8577 10.3453 12.6514 10.0688H14.4217C14.7249 10.0688 14.9733 9.82187 14.9733 9.51719C14.9724 9.37106 14.9137 9.23122 14.8101 9.12818C14.7065 9.02514 14.5663 8.96727 14.4202 8.96719V8.96719ZM4.77643 1.95312L13.7733 1.98281L12.8921 6.91719L5.82487 6.92969L4.77643 1.95312ZM6.29049 11.5266C6.01862 11.5266 5.79674 11.3047 5.79674 11.0328C5.79674 10.7609 6.01862 10.5391 6.29049 10.5391C6.56237 10.5391 6.78424 10.7609 6.78424 11.0328C6.78424 11.1638 6.73222 11.2894 6.63962 11.3819C6.54703 11.4745 6.42144 11.5266 6.29049 11.5266V11.5266ZM11.3702 11.5266C11.0983 11.5266 10.8764 11.3047 10.8764 11.0328C10.8764 10.7609 11.0983 10.5391 11.3702 10.5391C11.6421 10.5391 11.8639 10.7609 11.8639 11.0328C11.8639 11.1638 11.8119 11.2894 11.7193 11.3819C11.6267 11.4745 11.5011 11.5266 11.3702 11.5266V11.5266Z"
                  fill="#FFF" />
              </svg>
            </button>
            <div class="food-card-price">250 &#8381;</div>
          </div>
        </div>
      </div>
      <div class="card food-card">
        <div class="card-img food-card-img">
          <img src="../assets/images/food-2.jpg" alt="dish image">
        </div>
        <div class="food-card-info-wrapper">
          <h3 class="card-name food-card-title">Калифорния лосось стандарт</h3>
          <p class="food-card-description">Рис, лосось, авокадо, огурец, майонез, икра масаго, водоросли нори.</p>
          <div class="card-info-box">
            <button type="button" class="btn primary-btn">
              В корзину
              <svg width="15" height="13" viewBox="0 0 15 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path
                  d="M14.4202 8.96719H5.11549L5.58268 8.01562L13.3452 8.00156C13.6077 8.00156 13.8327 7.81406 13.8796 7.55469L14.9546 1.5375C14.9827 1.37969 14.9405 1.21719 14.8374 1.09375C14.7864 1.033 14.7228 0.984065 14.6511 0.950339C14.5793 0.916613 14.501 0.898903 14.4217 0.898438L4.54674 0.865625L4.46237 0.46875C4.40924 0.215625 4.18112 0.03125 3.92174 0.03125H1.50768C1.36139 0.03125 1.2211 0.0893608 1.11766 0.192799C1.01423 0.296237 0.956116 0.436529 0.956116 0.582813C0.956116 0.729096 1.01423 0.869388 1.11766 0.972826C1.2211 1.07626 1.36139 1.13438 1.50768 1.13438H3.47487L3.84362 2.8875L4.75143 7.28281L3.58268 9.19063C3.52198 9.27254 3.48543 9.36981 3.47714 9.47143C3.46886 9.57305 3.48918 9.67496 3.5358 9.76562C3.62955 9.95156 3.81862 10.0688 4.02799 10.0688H5.00924C4.80005 10.3466 4.68706 10.685 4.68737 11.0328C4.68737 11.9172 5.40612 12.6359 6.29049 12.6359C7.17487 12.6359 7.89362 11.9172 7.89362 11.0328C7.89362 10.6844 7.77799 10.3453 7.57174 10.0688H10.0889C9.87974 10.3466 9.76675 10.685 9.76705 11.0328C9.76705 11.9172 10.4858 12.6359 11.3702 12.6359C12.2546 12.6359 12.9733 11.9172 12.9733 11.0328C12.9733 10.6844 12.8577 10.3453 12.6514 10.0688H14.4217C14.7249 10.0688 14.9733 9.82187 14.9733 9.51719C14.9724 9.37106 14.9137 9.23122 14.8101 9.12818C14.7065 9.02514 14.5663 8.96727 14.4202 8.96719V8.96719ZM4.77643 1.95312L13.7733 1.98281L12.8921 6.91719L5.82487 6.92969L4.77643 1.95312ZM6.29049 11.5266C6.01862 11.5266 5.79674 11.3047 5.79674 11.0328C5.79674 10.7609 6.01862 10.5391 6.29049 10.5391C6.56237 10.5391 6.78424 10.7609 6.78424 11.0328C6.78424 11.1638 6.73222 11.2894 6.63962 11.3819C6.54703 11.4745 6.42144 11.5266 6.29049 11.5266V11.5266ZM11.3702 11.5266C11.0983 11.5266 10.8764 11.3047 10.8764 11.0328C10.8764 10.7609 11.0983 10.5391 11.3702 10.5391C11.6421 10.5391 11.8639 10.7609 11.8639 11.0328C11.8639 11.1638 11.8119 11.2894 11.7193 11.3819C11.6267 11.4745 11.5011 11.5266 11.3702 11.5266V11.5266Z"
                  fill="#FFF" />
              </svg>
            </button>
            <div class="food-card-price">250 &#8381;</div>
          </div>
        </div>
      </div>
      <div class="card food-card">
        <div class="card-img food-card-img">
          <img src="../assets/images/food-3.jpg" alt="dish image">
        </div>
        <div class="food-card-info-wrapper">
          <h3 class="card-name food-card-title">Окинава стандарт</h3>
          <p class="food-card-description"> Рис, креветка отварная, сыр сливочный, лосось, огурец свежий...</p>
          <div class="card-info-box">
            <button type="button" class="btn primary-btn">
              В корзину
              <svg width="15" height="13" viewBox="0 0 15 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path
                  d="M14.4202 8.96719H5.11549L5.58268 8.01562L13.3452 8.00156C13.6077 8.00156 13.8327 7.81406 13.8796 7.55469L14.9546 1.5375C14.9827 1.37969 14.9405 1.21719 14.8374 1.09375C14.7864 1.033 14.7228 0.984065 14.6511 0.950339C14.5793 0.916613 14.501 0.898903 14.4217 0.898438L4.54674 0.865625L4.46237 0.46875C4.40924 0.215625 4.18112 0.03125 3.92174 0.03125H1.50768C1.36139 0.03125 1.2211 0.0893608 1.11766 0.192799C1.01423 0.296237 0.956116 0.436529 0.956116 0.582813C0.956116 0.729096 1.01423 0.869388 1.11766 0.972826C1.2211 1.07626 1.36139 1.13438 1.50768 1.13438H3.47487L3.84362 2.8875L4.75143 7.28281L3.58268 9.19063C3.52198 9.27254 3.48543 9.36981 3.47714 9.47143C3.46886 9.57305 3.48918 9.67496 3.5358 9.76562C3.62955 9.95156 3.81862 10.0688 4.02799 10.0688H5.00924C4.80005 10.3466 4.68706 10.685 4.68737 11.0328C4.68737 11.9172 5.40612 12.6359 6.29049 12.6359C7.17487 12.6359 7.89362 11.9172 7.89362 11.0328C7.89362 10.6844 7.77799 10.3453 7.57174 10.0688H10.0889C9.87974 10.3466 9.76675 10.685 9.76705 11.0328C9.76705 11.9172 10.4858 12.6359 11.3702 12.6359C12.2546 12.6359 12.9733 11.9172 12.9733 11.0328C12.9733 10.6844 12.8577 10.3453 12.6514 10.0688H14.4217C14.7249 10.0688 14.9733 9.82187 14.9733 9.51719C14.9724 9.37106 14.9137 9.23122 14.8101 9.12818C14.7065 9.02514 14.5663 8.96727 14.4202 8.96719V8.96719ZM4.77643 1.95312L13.7733 1.98281L12.8921 6.91719L5.82487 6.92969L4.77643 1.95312ZM6.29049 11.5266C6.01862 11.5266 5.79674 11.3047 5.79674 11.0328C5.79674 10.7609 6.01862 10.5391 6.29049 10.5391C6.56237 10.5391 6.78424 10.7609 6.78424 11.0328C6.78424 11.1638 6.73222 11.2894 6.63962 11.3819C6.54703 11.4745 6.42144 11.5266 6.29049 11.5266V11.5266ZM11.3702 11.5266C11.0983 11.5266 10.8764 11.3047 10.8764 11.0328C10.8764 10.7609 11.0983 10.5391 11.3702 10.5391C11.6421 10.5391 11.8639 10.7609 11.8639 11.0328C11.8639 11.1638 11.8119 11.2894 11.7193 11.3819C11.6267 11.4745 11.5011 11.5266 11.3702 11.5266V11.5266Z"
                  fill="#FFF" />
              </svg>
            </button>
            <div class="food-card-price">250 &#8381;</div>
          </div>
        </div>
      </div>
      <div class="card food-card">
        <div class="card-img food-card-img">
          <img src="../assets/images/food-4.jpg" alt="dish image">
        </div>
        <div class="food-card-info-wrapper">
          <h3 class="card-name food-card-title">Цезарь маки хl</h3>
          <p class="food-card-description">Рис, куриная грудка копченая, икра масаго, томат, айсберг, соус
            цезарь...</p>
          <div class="card-info-box">
            <button type="button" class="btn primary-btn">
              В корзину
              <svg width="15" height="13" viewBox="0 0 15 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path
                  d="M14.4202 8.96719H5.11549L5.58268 8.01562L13.3452 8.00156C13.6077 8.00156 13.8327 7.81406 13.8796 7.55469L14.9546 1.5375C14.9827 1.37969 14.9405 1.21719 14.8374 1.09375C14.7864 1.033 14.7228 0.984065 14.6511 0.950339C14.5793 0.916613 14.501 0.898903 14.4217 0.898438L4.54674 0.865625L4.46237 0.46875C4.40924 0.215625 4.18112 0.03125 3.92174 0.03125H1.50768C1.36139 0.03125 1.2211 0.0893608 1.11766 0.192799C1.01423 0.296237 0.956116 0.436529 0.956116 0.582813C0.956116 0.729096 1.01423 0.869388 1.11766 0.972826C1.2211 1.07626 1.36139 1.13438 1.50768 1.13438H3.47487L3.84362 2.8875L4.75143 7.28281L3.58268 9.19063C3.52198 9.27254 3.48543 9.36981 3.47714 9.47143C3.46886 9.57305 3.48918 9.67496 3.5358 9.76562C3.62955 9.95156 3.81862 10.0688 4.02799 10.0688H5.00924C4.80005 10.3466 4.68706 10.685 4.68737 11.0328C4.68737 11.9172 5.40612 12.6359 6.29049 12.6359C7.17487 12.6359 7.89362 11.9172 7.89362 11.0328C7.89362 10.6844 7.77799 10.3453 7.57174 10.0688H10.0889C9.87974 10.3466 9.76675 10.685 9.76705 11.0328C9.76705 11.9172 10.4858 12.6359 11.3702 12.6359C12.2546 12.6359 12.9733 11.9172 12.9733 11.0328C12.9733 10.6844 12.8577 10.3453 12.6514 10.0688H14.4217C14.7249 10.0688 14.9733 9.82187 14.9733 9.51719C14.9724 9.37106 14.9137 9.23122 14.8101 9.12818C14.7065 9.02514 14.5663 8.96727 14.4202 8.96719V8.96719ZM4.77643 1.95312L13.7733 1.98281L12.8921 6.91719L5.82487 6.92969L4.77643 1.95312ZM6.29049 11.5266C6.01862 11.5266 5.79674 11.3047 5.79674 11.0328C5.79674 10.7609 6.01862 10.5391 6.29049 10.5391C6.56237 10.5391 6.78424 10.7609 6.78424 11.0328C6.78424 11.1638 6.73222 11.2894 6.63962 11.3819C6.54703 11.4745 6.42144 11.5266 6.29049 11.5266V11.5266ZM11.3702 11.5266C11.0983 11.5266 10.8764 11.3047 10.8764 11.0328C10.8764 10.7609 11.0983 10.5391 11.3702 10.5391C11.6421 10.5391 11.8639 10.7609 11.8639 11.0328C11.8639 11.1638 11.8119 11.2894 11.7193 11.3819C11.6267 11.4745 11.5011 11.5266 11.3702 11.5266V11.5266Z"
                  fill="#FFF" />
              </svg>
            </button>
            <div class="food-card-price">250 &#8381;</div>
          </div>
        </div>
      </div>
      <div class="card food-card">
        <div class="card-img food-card-img">
          <img src="../assets/images/food-5.jpg" alt="dish image">
        </div>
        <div class="food-card-info-wrapper">
          <h3 class="card-name food-card-title">Ясай маки стандарт 185 г</h3>
          <p class="food-card-description">Рис, помидор свежий, перец болгарский, авокадо, огурец, айсберг</p>
          <div class="card-info-box">
            <button type="button" class="btn primary-btn">
              В корзину
              <svg width="15" height="13" viewBox="0 0 15 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path
                  d="M14.4202 8.96719H5.11549L5.58268 8.01562L13.3452 8.00156C13.6077 8.00156 13.8327 7.81406 13.8796 7.55469L14.9546 1.5375C14.9827 1.37969 14.9405 1.21719 14.8374 1.09375C14.7864 1.033 14.7228 0.984065 14.6511 0.950339C14.5793 0.916613 14.501 0.898903 14.4217 0.898438L4.54674 0.865625L4.46237 0.46875C4.40924 0.215625 4.18112 0.03125 3.92174 0.03125H1.50768C1.36139 0.03125 1.2211 0.0893608 1.11766 0.192799C1.01423 0.296237 0.956116 0.436529 0.956116 0.582813C0.956116 0.729096 1.01423 0.869388 1.11766 0.972826C1.2211 1.07626 1.36139 1.13438 1.50768 1.13438H3.47487L3.84362 2.8875L4.75143 7.28281L3.58268 9.19063C3.52198 9.27254 3.48543 9.36981 3.47714 9.47143C3.46886 9.57305 3.48918 9.67496 3.5358 9.76562C3.62955 9.95156 3.81862 10.0688 4.02799 10.0688H5.00924C4.80005 10.3466 4.68706 10.685 4.68737 11.0328C4.68737 11.9172 5.40612 12.6359 6.29049 12.6359C7.17487 12.6359 7.89362 11.9172 7.89362 11.0328C7.89362 10.6844 7.77799 10.3453 7.57174 10.0688H10.0889C9.87974 10.3466 9.76675 10.685 9.76705 11.0328C9.76705 11.9172 10.4858 12.6359 11.3702 12.6359C12.2546 12.6359 12.9733 11.9172 12.9733 11.0328C12.9733 10.6844 12.8577 10.3453 12.6514 10.0688H14.4217C14.7249 10.0688 14.9733 9.82187 14.9733 9.51719C14.9724 9.37106 14.9137 9.23122 14.8101 9.12818C14.7065 9.02514 14.5663 8.96727 14.4202 8.96719V8.96719ZM4.77643 1.95312L13.7733 1.98281L12.8921 6.91719L5.82487 6.92969L4.77643 1.95312ZM6.29049 11.5266C6.01862 11.5266 5.79674 11.3047 5.79674 11.0328C5.79674 10.7609 6.01862 10.5391 6.29049 10.5391C6.56237 10.5391 6.78424 10.7609 6.78424 11.0328C6.78424 11.1638 6.73222 11.2894 6.63962 11.3819C6.54703 11.4745 6.42144 11.5266 6.29049 11.5266V11.5266ZM11.3702 11.5266C11.0983 11.5266 10.8764 11.3047 10.8764 11.0328C10.8764 10.7609 11.0983 10.5391 11.3702 10.5391C11.6421 10.5391 11.8639 10.7609 11.8639 11.0328C11.8639 11.1638 11.8119 11.2894 11.7193 11.3819C11.6267 11.4745 11.5011 11.5266 11.3702 11.5266V11.5266Z"
                  fill="#FFF" />
              </svg>
            </button>
            <div class="food-card-price">250 &#8381;</div>
          </div>
        </div>
      </div>
      <div class="card food-card">
        <div class="card-img food-card-img">
          <img src="../assets/images/food-6.jpg" alt="dish image">
        </div>
        <div class="food-card-info-wrapper">
          <h3 class="card-name food-card-title">Ролл с креветкой стандарт</h3>
          <p class="food-card-description">Рис, водоросли нори, креветки отварные, сыр сливочный, огурцы</p>
          <div class="card-info-box">
            <button type="button" class="btn primary-btn">
              В корзину
              <svg width="15" height="13" viewBox="0 0 15 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path
                  d="M14.4202 8.96719H5.11549L5.58268 8.01562L13.3452 8.00156C13.6077 8.00156 13.8327 7.81406 13.8796 7.55469L14.9546 1.5375C14.9827 1.37969 14.9405 1.21719 14.8374 1.09375C14.7864 1.033 14.7228 0.984065 14.6511 0.950339C14.5793 0.916613 14.501 0.898903 14.4217 0.898438L4.54674 0.865625L4.46237 0.46875C4.40924 0.215625 4.18112 0.03125 3.92174 0.03125H1.50768C1.36139 0.03125 1.2211 0.0893608 1.11766 0.192799C1.01423 0.296237 0.956116 0.436529 0.956116 0.582813C0.956116 0.729096 1.01423 0.869388 1.11766 0.972826C1.2211 1.07626 1.36139 1.13438 1.50768 1.13438H3.47487L3.84362 2.8875L4.75143 7.28281L3.58268 9.19063C3.52198 9.27254 3.48543 9.36981 3.47714 9.47143C3.46886 9.57305 3.48918 9.67496 3.5358 9.76562C3.62955 9.95156 3.81862 10.0688 4.02799 10.0688H5.00924C4.80005 10.3466 4.68706 10.685 4.68737 11.0328C4.68737 11.9172 5.40612 12.6359 6.29049 12.6359C7.17487 12.6359 7.89362 11.9172 7.89362 11.0328C7.89362 10.6844 7.77799 10.3453 7.57174 10.0688H10.0889C9.87974 10.3466 9.76675 10.685 9.76705 11.0328C9.76705 11.9172 10.4858 12.6359 11.3702 12.6359C12.2546 12.6359 12.9733 11.9172 12.9733 11.0328C12.9733 10.6844 12.8577 10.3453 12.6514 10.0688H14.4217C14.7249 10.0688 14.9733 9.82187 14.9733 9.51719C14.9724 9.37106 14.9137 9.23122 14.8101 9.12818C14.7065 9.02514 14.5663 8.96727 14.4202 8.96719V8.96719ZM4.77643 1.95312L13.7733 1.98281L12.8921 6.91719L5.82487 6.92969L4.77643 1.95312ZM6.29049 11.5266C6.01862 11.5266 5.79674 11.3047 5.79674 11.0328C5.79674 10.7609 6.01862 10.5391 6.29049 10.5391C6.56237 10.5391 6.78424 10.7609 6.78424 11.0328C6.78424 11.1638 6.73222 11.2894 6.63962 11.3819C6.54703 11.4745 6.42144 11.5266 6.29049 11.5266V11.5266ZM11.3702 11.5266C11.0983 11.5266 10.8764 11.3047 10.8764 11.0328C10.8764 10.7609 11.0983 10.5391 11.3702 10.5391C11.6421 10.5391 11.8639 10.7609 11.8639 11.0328C11.8639 11.1638 11.8119 11.2894 11.7193 11.3819C11.6267 11.4745 11.5011 11.5266 11.3702 11.5266V11.5266Z"
                  fill="#FFF" />
              </svg>
            </button>
            <div class="food-card-price">250 &#8381;</div>
          </div>
        </div>
      </div>
    </div>
  </section>
</template>

<style scoped>
.restaurants-title-box {
  display: flex;
  justify-content: flex-start;
  gap: 28px;
  align-items: center;
  flex-wrap: wrap;
  margin-bottom: 44px;
}

.restaurants-title {
  font-weight: 700;
  font-size: 36px;
  color: var(--gray---gray-10);
}

.restaurants-search-box {
  border: 1px solid var(--gray---gray-5);
  border-radius: 2px;
  background: var(--gray---gray-1);
  width: 306px;
  height: 34px;
  display: flex;
  justify-content: flex-start;
  align-items: center;
  gap: 4px;
  padding: 5px 12px;
}

.restaurants-search-btn {
  padding: 1px;
  border: none;
  background-color: inherit;
  width: 18px;
  height: 18px;
}

.restaurants-search {
  font-weight: 400;
  font-size: 16px;
  line-height: 150%;
  color: #bfbfbf;
  border: none;
  width: 90%;
  outline: none;
}

.restaurants-search::placeholder {
  color: #bfbfbf;
}

.cards-box {
  display: flex;
  justify-content: space-between;
  align-items: center;
  flex-wrap: wrap;
  margin-bottom: 60px;
}

.card {
  width: 384px;
  min-height: 380px;
  gap: 24px;
  margin-bottom: 30px;
  border-radius: 7px;
  box-shadow: 0 4px 12px 0 rgba(0, 0, 0, 0.05);
  background: var(--gray---gray-1);
}

.food-card {
  min-height: 412px;
}

.card-img {
  width: 100%;
  height: 66%;
  overflow: hidden;
}

.food-card-img {
  height: 52%;
}

.card-description {
  padding: 20px 24px 34px 24px;
}

.food-card-description {
  font-weight: 400;
  font-size: 18px;
  color: var(--gray---gray-7);
  margin-bottom: 25px;
}

.food-card-info-wrapper {
  padding: 24px 24px 30px 24px;
}

.card-name-box {
  display: flex;
  justify-content: space-between;
  align-items: center;
  margin-bottom: 10px;
}

.card-name {
  font-weight: 700;
  font-size: 24px;
  line-height: 133%;
  color: var(--gray---gray-10);
}

.food-card-title {
  font-weight: 400;
  margin-bottom: 10px;
}

.card-time {
  border-radius: 2px;
  padding: 1px 8px;
  min-width: 56px;
  height: 22px;
  background: var(--gray---gray-9);
  font-weight: 400;
  font-size: 12px;
  line-height: 167%;
  color: var(--gray---gray-1);
}

.card-info-box {
  display: flex;
  justify-content: flex-start;
  align-items: center;
  gap: 26px;
}

.card-rating {
  font-weight: 700;
  font-size: 18px;
  line-height: 178%;
  color: #ffc107;
  display: flex;
  align-items: center;
  gap: 10px;
}

.card-price {
  font-weight: 400;
  font-size: 18px;
  line-height: 178%;
  color: var(--gray---gray-7);
}

.food-card-price {
  font-weight: 700;
  font-size: 20px;
  line-height: 160%;
  color: var(--gray---gray-10);
}

.restaurant-rating {
  font-family: var(--font-family);
  font-weight: 700;
  font-size: 18px;
  line-height: 178%;
  color: #ffc107;
  display: flex;
  align-items: center;
  gap: 7.5px;
}

.restaurant-price {
  font-weight: 400;
  font-size: 18px;
  line-height: 178%;
  color: var(--gray---gray-7);
}

.cart-modal__overlay {
  display: none;
  position: fixed;
  width: 100%;
  height: 100%;
  top: 0;
  left: 0;
  background: rgba(0, 0, 0, 0.4);
  z-index: 99;
}

.cart-modal__overlay.open {
  display: block;
}

.cart-modal {
  position: relative;
  padding: 40px 46px;
  max-width: 780px;
  min-height: 100px;
  border-radius: 5px;
  background: var(--gray---gray-1);
  left: 50%;
  top: 50%;
  transform: translate(-50%, -50%);
}

.cart-modal__title-box {
  display: flex;
  justify-content: space-between;
  align-items: center;
  margin-bottom: 45px;
}

.product-name {
  font-weight: 400;
  font-size: 18px;
  line-height: 178%;
  color: var(--gray---gray-10);
}

.close-btn {
  padding: 10px;
  background: inherit;
}

.cart-modal__products-list {
  margin-bottom: 53px;
}

.cart-modal__products-list ul li {
  margin-bottom: 15px;
}

.cart-modal__product-item {
  display: flex;
  justify-content: space-between;
  align-items: center;
  padding: 0 15px 10px 0;
  border-bottom: 1px solid var(--gray---gray-5);
}

.product-controls-box {
  display: flex;
  justify-content: space-between;
  align-items: center;
  gap: 47px;
}

.product-price {
  font-weight: 700;
  font-size: 20px;
  line-height: 160%;
  color: var(--gray---gray-10);
}

.product-btns-box {
  display: flex;
  justify-content: space-between;
  align-items: center;
  gap: 14px;
}

.product-count {
  font-weight: 400;
  font-size: 16px;
  line-height: 150%;
  text-align: center;
  color: var(--gray---gray-10);
}

.cart-modal-btn {
  min-width: 32px;
  border: 1px solid var(--daybreak-blue---blue-5);
  border-radius: 2px;
  padding: 5px 16px;
  background: var(--gray---gray-1);
  color: var(--daybreak-blue---blue-5);
}

.cart-modal__total-box {
  display: flex;
  justify-content: space-between;
  align-items: center;
}

.cart-modal__controls {
  display: flex;
  justify-content: space-between;
  align-items: center;
  gap: 10px;
}

.cart-modal__total-sum {
  border-radius: 5px;
  padding: 15px 20px;
  min-height: 53px;
  background: var(--gray---gray-9);
  font-weight: 700;
  font-size: 20px;
  color: var(--gray---gray-2);
}
</style>